<a href="https://colab.research.google.com/github/qisthinurr/Tugas_Python/blob/main/Tugas_Keempat_Qisthi_Nur_1101192487.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Depresi - Tugas Keempat (Materi 5)**

Nama        : Qisthi Nur Rahmah

NIM         : 1101192487

Nama Kampus : Universitas Telkom

In [1]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
import pandas as pd
data = pd.read_csv('Depresi.csv')
data.head(20)

   Pendidikan  Pendapatan  Umur Kemungkinan Depresi
0          SD    300000.0  50.0                  Ya
1          SD   3000000.0  30.0               Tidak
2         SMA     30000.0  17.0               Tidak
3          S1   5000000.0  40.0                  Ya
4          S2   1900000.0   NaN               Tidak
5         SMP   2125000.0  58.0                  Ya
6          SD    554000.0  26.0                  Ya
7         SMK         NaN  40.0               Tidak
8          SD    980000.0  33.0               Tidak
9          SD   2794000.0  35.0               Tidak
10        SMK    583000.0  43.0               Tidak
11        SMK   2329000.0  70.0               Tidak

In [4]:
data.isna().sum()

Pendidikan             0
Pendapatan             1
Umur                   1
Kemungkinan Depresi    0
dtype: int64

In [10]:
data1 = data.dropna (axis=0)
data1.head(20)

   Pendidikan  Pendapatan  Umur Kemungkinan Depresi
0          SD    300000.0  50.0                  Ya
1          SD   3000000.0  30.0               Tidak
2         SMA     30000.0  17.0               Tidak
3          S1   5000000.0  40.0                  Ya
5         SMP   2125000.0  58.0                  Ya
6          SD    554000.0  26.0                  Ya
8          SD    980000.0  33.0               Tidak
9          SD   2794000.0  35.0               Tidak
10        SMK    583000.0  43.0               Tidak
11        SMK   2329000.0  70.0               Tidak

In [8]:
data2 = data.dropna (axis=1)
data2.head(20)

   Pendidikan Kemungkinan Depresi
0          SD                  Ya
1          SD               Tidak
2         SMA               Tidak
3          S1                  Ya
4          S2               Tidak
5         SMP                  Ya
6          SD                  Ya
7         SMK               Tidak
8          SD               Tidak
9          SD               Tidak
10        SMK               Tidak
11        SMK               Tidak

In [11]:
data.isna().sum()

Pendidikan             0
Pendapatan             1
Umur                   1
Kemungkinan Depresi    0
dtype: int64

In [12]:
data.dtypes

Pendidikan              object
Pendapatan             float64
Umur                   float64
Kemungkinan Depresi     object
dtype: object

In [13]:
import numpy as np
numeric = data.select_dtypes(include=np.number)
numeric_columns = numeric.columns
print(numeric_columns)

Index(['Pendapatan', 'Umur'], dtype='object')

In [19]:
data[numeric_columns] = data[numeric_columns].fillna(data.mean())
data.head(20)

   Pendidikan    Pendapatan       Umur Kemungkinan Depresi
0          SD  3.000000e+05  50.000000                  Ya
1          SD  3.000000e+06  30.000000               Tidak
2         SMA  3.000000e+04  17.000000               Tidak
3          S1  5.000000e+06  40.000000                  Ya
4          S2  1.900000e+06  40.181818               Tidak
5         SMP  2.125000e+06  58.000000                  Ya
6          SD  5.540000e+05  26.000000                  Ya
7         SMK  1.781364e+06  40.000000               Tidak
8          SD  9.800000e+05  33.000000               Tidak
9          SD  2.794000e+06  35.000000               Tidak
10        SMK  5.830000e+05  43.000000               Tidak
11        SMK  2.329000e+06  70.000000               Tidak

In [20]:
data.isna().sum()

Pendidikan             0
Pendapatan             0
Umur                   0
Kemungkinan Depresi    0
dtype: int64